{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 23, "W_constraint": null, "name": "embedding_1", "activity_regularizer": null, "trainable": true, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "batch_input_shape": [null, 23], "W_regularizer": null, "dropout": 0.0, "input_dim": 11500, "output_dim": 128}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution1D", "config": {"input_length": null, "W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "uniform", "bias": true, "nb_filter": 64, "input_dim": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "border_mode": "valid"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 2, "trainable": true, "name": "maxpooling1d_1", "border_mode": "valid"}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "input_length": null, "name": "lstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "init": "glorot_uniform", "stateful": false, "unroll": false, "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "consume_less": "cpu", "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "input_dim": 64, "forget_bias_init": "one", "output_dim": 70}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 23, "W_constraint": null, "name": "embedding_2", "activity_regularizer": null, "trainable": true, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "batch_input_shape": [null, 23], "W_regularizer": null, "dropout": 0.0, "input_dim": 11500, "output_dim": 128}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution1D", "config": {"input_length": null, "W_constraint": null, "b_constraint": null, "name": "convolution1d_2", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "uniform", "bias": true, "nb_filter": 64, "input_dim": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "border_mode": "valid"}}, {"class_name": "MaxPooling1D", "config": {"stride": 2, "pool_length": 2, "trainable": true, "name": "maxpooling1d_2", "border_mode": "valid"}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "input_length": null, "name": "lstm_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "init": "glorot_uniform", "stateful": false, "unroll": false, "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "consume_less": "cpu", "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "input_dim": 64, "forget_bias_init": "one", "output_dim": 70}}]}], "name": "merge_1", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_1"}}]}